Repository: ibis-hdl/compiler
Catalog: l10n/po/*.po
Languages: de

source: <<-- and here
de: <<-- und hier

source: <<-- here
de: <<-- hier

# Unknown File Name
source: <unknown>
de: <Unbekannt>

source: An unknown error occurred during parsing of '{1}'.
de: Unbekannter Fehler aufgetreten während des parsens von '{1}'.

source: Base specifier '{1}' isn't supported. Supported are only 2, 8, 10 and 16!
de: Basis Bezeichner '{1}' wird nicht unterstützt. Unterstützt wird nur 2, 8, 10 und 16!

# ExceptionDescription
source: Caught exception '{1}' during parsing file '{2}'
de: Ausnahme '{1}' gefangen während des parsens der Datei '{2}'

source: Conversion of VHDL {1} '{2}' failed due to numeric overflow (MAX_VALUE = {3})
de: Konvertierung vom VHDL {1} '{2}' fehlgeschlagen aufgrund eines numerischen Überlaufs (MAX_VALUE={3})

source: Duplicate file "{1}", specified as:
de: Doppelte Datei "{1}", spezifiziert als:

source: Error opening file "{1}"
de: Fehler beim öffnen der Datei "{1}"

source: Error reading file "{1}"
de: Fehler beim lesen der Datei "{1}"

source: Error, expecting {1} here:
de: Fehler, erwarte {1} hier:

source: Failed existence test for file {1}: caught exception {1}
de: Gescheiterter Test auf Existenz für Datei {1}: Ausnahme {1} gefangen

source: File {1} does not exists
de: Datei {1} existiert nicht

source: File {1} is not a regular file
de: Datei {1} ist keine reguläre Datei

source: Label ill-formed in {1}
de: Label unvollständig in {1}

source: Label mismatch in {1}
de: Label Diskrepanz in {1}

source: Numeric error occurred during calculation on based_literal with fractional part of '{1}'.
de: Numericher Fehler aufgetreten während der Berechnung des based_literal gebrochenen Teil von '{1}'.

source: Parse ERROR
de: Parser FEHLER

source: Source file '{1}' failed to parse!
de: Parsen der Quell-Datei '{1}' fehlgeschlagen

source: Syntax ERROR
de: Syntax FEHLER

source: Unable to open file "{1}"
de: Unfähig die Datei {1} zu öffnen

source: Unspecified Error, Sorry
de: Unspezifizierter Fehler, Sorry

source: WARNING: failed to lookup '{1}' at parser's expectation symbol table Note, end users can ignore the warning
de: Warnung: Nachschlagen in der Parser Symbol-Tabelle fehlgeschlagen Hinweis, Endanwender können den Hinweis ignorieren

source: in file {1}, line {2}:
de: In Datei {1}, Zeile {2}:

source: processing:
de: bearbeite:

# ExceptionDescription
source: unknown
de: unbekannt

source: {1} and {2} generated.
de: {1} und {2} generiert.

source: {1} error
de: {1} Fehler

source: {1} generated.
de: {1} generiert.

source: {1} warning
de: {1} Warnung
